import streamlit as st
import random

st.title("星座占い✨")
st.write("まずは星座を選んでね！")

st.selectbox("みたい星座を選択してね",["牡羊座","牡牛座","双子座","蟹座","獅子座","乙女座","天秤座","蠍座","射手座","山羊座","水瓶座","魚座"])

fortune = random.choice(["今日はラッキーデー！","今日は特に何もないよ！","今日は少し警戒したほうがいいかも…？","今日は最悪の日！？","めっちゃ良い日になるかも！"])
item = random.choice(["傘","ボールペン","ウサギのキーホルダー","眼鏡","セミの抜け殻","東京行きの新幹線の切符","うまい棒サラダ味","ガリガリくんのあたり棒","はま寿司のガチャガチャ","校庭","担任の自撮り"])
color = random.choice(["くすんだピンク","ドリンクバーの飲み物全部入れた色","地味に汚くなった上履きの底","賞味期限がいつかわからない牛乳の色","いつのかわからないクシャクシャのレシートの色","ランニングしてる人の蛍光色のTシャツ","今日一番明るかった友達のオーラの色"])

st.write(f"今日の運勢は:{fortune}")
st.write(f"今日のラッキーアイテム:{item}")
st.write(f"今日のラッキカラー:{color}")